:PROPERTIES:
:ID:       08468BD5-BAC0-4E47-95BE-EA1B72E88056
:END:
#+title: Managing development environments with Nix
#+author: Jeff Kreeftmeijer
#+date: 2024-05-02
#+options: toc:nil

[[https://nixos.org/manual/nix/stable/command-ref/new-cli/nix3-develop][Nix's develop program]] starts a shell with the results of a derivation.
For example, to start a bash shell with Cargo on a machine that doesn't have it installed:

#+headers: :eval no
#+begin_src shell
  nix develop nixpkgs#cargo
#+end_src

#+begin_example
bash-5.2$
#+end_example

The real use case of /develop/ is building development environments, which allow setting up a shell with multiple dependencies.

Nix's [[https://github.com/NixOS/templates/tree/master][template directory]] has some useful and community-maintained examples to get started building development environments.
For example, the [[https://github.com/NixOS/templates/blob/c57ac1ea60ef97bdce2f13e12b849f0ca5eaffe9/rust/flake.nix
][Rust template]] has a /flake/ that sets up everything needed in a Rust project:

#+caption: =flake.nix=
#+include: "rust/flake.nix" src nix

After saving it as ~flake.nix~ in a project's directory[fn:check-in], running =nix develop= starts the shell with everything available.
To skip the shell and run a one-off command, use the =--command= flag:

#+headers: :exports both
#+headers: :cache yes
#+begin_src shell
  nix develop --command cargo --version
#+end_src

#+RESULTS[3f75b9c5dd34ab878ff2e2190be3ea5f87a088fd]:
: cargo 1.77.1

Even easier; to automatically load the environment when entering the project's directory, use [[https://direnv.net][direnv]].
Create a file named =.envrc= containing the =use flake= directive:

#+caption: =.envrc=
#+begin_src envrc
  use flake .
#+end_src

Then, run src_shell[:exports code]{direnv allow} in the project directory, and all dependencies are added to the current shell.
When switching to another directory, the dependencies are unloaded until you return.

After checking in the flake, the =.envrc= file, and the generated =flake.lock=, the project's dependencies are automatically installed and version locked, resulting in a reproducable setup for the project.

* On-demand development environments

Managing environments with Nix is powerful, but a downside of this approach is that the flake file needs to be checked into version control.
That's not a problem for projects that use Nix to manage their dependencies, but, when working on a project you don't own, adding another way to handle dependencies might not be appreciated by the other maintainers.
Aside from that, it might be useful to share development environments between similar projects without having to duplicate the flake.

Luckily, both Nix and direnv allow dependencies to be loaded from other paths than the current directory.
To start a development shell from a flake in the =~/devshells/rust= directory, pass the directory path to the call to src_shell[:exports code]{nix develop} command:

#+headers: :cache yes
#+headers: :exports both
#+begin_src shell
  nix develop ~/devshells/rust --command cargo --version
#+end_src

#+RESULTS[394330679272b0eb0d64c90ddce56d7d6270fbfe]:
: cargo 1.77.1

To use a flake from outside the current directory with direnv, add a path to the directory containing the flake in the =.envrc= file:

#+caption: =.envrc=
#+begin_src envrc
  use flake ~/devshells/rust
#+end_src

This means that just having an ~.envrc~ file that points to a flake located elsewhere is enough to handle dependencies.
This still requires a single file to be added to the project directory, but it allows for moving the flake and lock file to a seperate, version-controlled, location.

* A repository of development environments

For projects I can't add flakes to, I use my own [[https://github.com/jeffkreeftmeijer/devshells][repository of development environments]][fn:repositories], which includes flakes for to set up the following languages and utilities:

- [[https://github.com/jeffkreeftmeijer/devshells/blob/main/rust/flake.nix][Rust]] :: version 1.77.1, with Cargo, rustfmt and Clippy

- [[https://github.com/jeffkreeftmeijer/devshells/blob/main/elixir/flake.nix][Elixir]] :: version 1.16.2 on Erlang 25.3.2.11

- [[https://github.com/jeffkreeftmeijer/devshells/blob/main/nodejs/flake.nix][Node.js]] :: version 22.0.0, with Prettier 3.2.5

- [[https://github.com/jeffkreeftmeijer/devshells/blob/main/postgresql/flake.nix][PostgreSQL]] :: version 15.6, with ~PGDATA~ configured to be directory-local

This means adding a single-line =.envrc= is enough to add a develoment environment for Rust projects:

#+caption: =.envrc=
#+begin_src envrc
  use flake ~/devshells/rust
#+end_src

This takes the flake file from the rust directory in my local checkout[fn:remote] of my development environment repository.

Because environments can be [[https://determinate.systems/posts/nix-direnv/#layering-environments][environments can be layered]], a Phoenix project requiring Elixir, Node.js and PostgresQL simply stacks three flakes:

#+caption: =.envrc=
#+begin_src envrc
  use flake ~/devshells/elixir
  use flake ~/devshells/nodejs
  use flake ~/devshells/postgresql
#+end_src

[fn:check-in] After adding the flake, ensure it's checked into version control.
If not, Nix can't find it and will throw an error message that doesn't /quite/ explain what's wrong:

#+begin_example
error: getting status of '/nix/store/0ccnxa25whszw7mgbgyzdm4nqc0zwnm8-source/flake.nix': No such file or directory
#+end_example

[fn:repositories] Other repositories with development environment exist, like the aforementioned [[https://github.com/NixOS/templates][NixOS/templates]] and [[https://github.com/the-nix-way/dev-templates][the-nix-way/dev-templates]].
One could point a project's =.envrc= file directly to one of these and get a working environment.
I've done that in the past, and will certainly continue doing so.

However, if I have to return to a project frequently, I prefer setting up my own development shell and running from that.
Preparing one myself ensures the shell doesn't include anything that's not needed for my projects, and makes any issues that arise easier to debug.

Still, these repositories are a great starting point for writing your own development shells.
My Rust shell, for example, is based on the [[https://github.com/NixOS/templates/blob/c57ac1ea60ef97bdce2f13e12b849f0ca5eaffe9/rust/flake.nix][the Rust flake from NixOS/templates]].

[fn:remote] Instead of using a local checkout, you could also point the =.envrc= file directly to a file on GitHub, for example:

#+caption: =.envrc=
#+begin_src envrc
  use flake github:jeffkreeftmeijer/devenv?dir=rust
#+end_src

This makes the setup more portable, but removes the ability to use and update lock files.
Since I prefer my development environments to be version-locked and infrequently updated, that's a dealbreaker for me.
